Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71J21.xml
        <register caption="Keypad Controller Interrupt Mask Register" name="PIO_KIMR" offset="0x0138" rw="R" size="4">
          <bitfield caption="Key Press Interrupt Mask" mask="0x00000001" name="KPR"/>
          <bitfield caption="Key Release Interrupt Mask" mask="0x00000002" name="KRL"/>
        </register>
        <register caption="Keypad Controller Status Register" name="PIO_KSR" offset="0x013C" rw="R" size="4">
          <bitfield caption="Key Press Status" mask="0x00000001" name="KPR"/>
          <bitfield caption="Key Release Status" mask="0x00000002" name="KRL"/>
          <bitfield caption="Number of Simultaneous Key Presses" mask="0x00000300" name="NBKPR"/>
          <bitfield caption="Number of Simultaneous Key Releases" mask="0x00030000" name="NBKRL"/>
        </register>
        <register caption="Keypad Controller Key Press Register" name="PIO_KKPR" offset="0x0140" rw="R" size="4">
          <bitfield caption="Row Index of the First Detected Key Press" mask="0x00000007" name="KEY0ROW"/>
          <bitfield caption="Column Index of the First Detected Key Press" mask="0x00000070" name="KEY0COL"/>
          <bitfield caption="Row Index of the Second Detected Key Press" mask="0x00000700" name="KEY1ROW"/>
          <bitfield caption="Column Index of the Second Detected Key Press" mask="0x00007000" name="KEY1COL"/>
          <bitfield caption="Row Index of the Third Detected Key Press" mask="0x00070000" name="KEY2ROW"/>
          <bitfield caption="Column Index of the Third Detected Key Press" mask="0x00700000" name="KEY2COL"/>
          <bitfield caption="Row Index of the Fourth Detected Key Press" mask="0x07000000" name="KEY3ROW"/>
          <bitfield caption="Column Index of the Fourth Detected Key Press" mask="0x70000000" name="KEY3COL"/>
        </register>
        <register caption="Keypad Controller Key Release Register" name="PIO_KKRR" offset="0x0144" rw="R" size="4">
          <bitfield caption="Row Index of the First Detected Key Release" mask="0x00000007" name="KEY0ROW"/>
          <bitfield caption="Column Index of the First Detected Key Release" mask="0x00000070" name="KEY0COL"/>
          <bitfield caption="Row Index of the Second Detected Key Release" mask="0x00000700" name="KEY1ROW"/>
          <bitfield caption="Column Index of the Second Detected Key Release" mask="0x00007000" name="KEY1COL"/>
          <bitfield caption="Row Index of the Third Detected Key Release" mask="0x00070000" name="KEY2ROW"/>
          <bitfield caption="Column Index of the Third Detected Key Release" mask="0x00700000" name="KEY2COL"/>
          <bitfield caption="Row Index of the Fourth Detected Key Release" mask="0x07000000" name="KEY3ROW"/>
          <bitfield caption="Column Index of the Fourth Detected Key Release" mask="0x70000000" name="KEY3COL"/>
        </register>
        <register caption="Parallel Capture Mode Register" name="PIO_PCMR" offset="0x0150" rw="RW" size="4">
          <bitfield caption="Parallel Capture Mode Enable" mask="0x00000001" name="PCEN"/>
          <bitfield caption="Parallel Capture Mode Data Size" mask="0x00000030" name="DSIZE" values="PIO_PCMR__DSIZE"/>
          <bitfield caption="Parallel Capture Mode Always Sampling" mask="0x00000200" name="ALWYS"/>
          <bitfield caption="Parallel Capture Mode Half Sampling" mask="0x00000400" name="HALFS"/>
          <bitfield caption="Parallel Capture Mode First Sample" mask="0x00000800" name="FRSTS"/>
        </register>
        <register caption="Parallel Capture Interrupt Enable Register" name="PIO_PCIER" offset="0x0154" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Enable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Enable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Enable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Disable Register" name="PIO_PCIDR" offset="0x0158" rw="W" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Disable" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Disable" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Disable" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Mask Register" name="PIO_PCIMR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready Interrupt Mask" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error Interrupt Mask" mask="0x00000002" name="OVRE"/>
          <bitfield caption="End of Reception Transfer Interrupt Mask" mask="0x00000004" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
        </register>
        <register caption="Parallel Capture Interrupt Status Register" name="PIO_PCISR" offset="0x0160" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Data Ready" mask="0x00000001" name="DRDY"/>
          <bitfield caption="Parallel Capture Mode Overrun Error" mask="0x00000002" name="OVRE"/>
        </register>
        <register caption="Parallel Capture Reception Holding Register" name="PIO_PCRHR" offset="0x0164" rw="R" size="4">
          <bitfield caption="Parallel Capture Mode Reception Data" mask="0xFFFFFFFF" name="RDATA"/>
        </register>
      </register-group>
      <value-group caption="" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
