Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71J21.xml
      <value-group caption="" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" name="TRNG" version="6334E">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enables the TRNG to provide random values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Security Key." mask="0xFFFFFF00" name="KEY" values="TRNG_CR__KEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
      </register-group>
      <value-group caption="" name="TRNG_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524E47"/>
      </value-group>
    </module>
    <module caption="Two-wire Interface High Speed" name="TWIHS" version="11210Q">
      <register-group name="TWIHS">
        <register caption="Control Register" name="TWIHS_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Send a START Condition" mask="0x00000001" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" name="STOP"/>
          <bitfield caption="TWIHS Master Mode Enabled" mask="0x00000004" name="MSEN"/>
          <bitfield caption="TWIHS Master Mode Disabled" mask="0x00000008" name="MSDIS"/>
          <bitfield caption="TWIHS Slave Mode Enabled" mask="0x00000010" name="SVEN"/>
          <bitfield caption="TWIHS Slave Mode Disabled" mask="0x00000020" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="TWIHS High-Speed Mode Enabled" mask="0x00000100" name="HSEN"/>
          <bitfield caption="TWIHS High-Speed Mode Disabled" mask="0x00000200" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" name="CLEAR"/>
        </register>
        <register caption="Master Mode Register" name="TWIHS_MMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="TWIHS_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="Slave Mode Register" name="TWIHS_SMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
          <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
          <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
          <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
          <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
        </register>
        <register caption="Internal Address Register" name="TWIHS_IADR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWIHS_CWGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x1F000000" name="HOLD"/>
        </register>
        <register caption="Status Register" name="TWIHS_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Transmission Completed (cleared by writing TWIHS_THR)" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared by reading TWIHS_RHR)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing TWIHS_THR)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" name="SMBHHM"/>
          <bitfield caption="SCL line value" mask="0x01000000" name="SCL"/>
          <bitfield caption="SDA line value" mask="0x02000000" name="SDA"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWIHS_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Enable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Enable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Enable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Enable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Enable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWIHS_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Disable" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Disable" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Disable" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Disable" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Disable" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWIHS_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000080" name="UNRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge Interrupt Mask" mask="0x00010000" name="MCACK"/>
          <bitfield caption="Timeout Error Interrupt Mask" mask="0x00040000" name="TOUT"/>
          <bitfield caption="PEC Error Interrupt Mask" mask="0x00080000" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match Interrupt Mask" mask="0x00100000" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match Interrupt Mask" mask="0x00200000" name="SMBHHM"/>
        </register>
        <register caption="Receive Holding Register" name="TWIHS_RHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" name="RXDATA"/>
        </register>
        <register caption="Transmit Holding Register" name="TWIHS_THR" offset="0x34" rw="W" size="4">
          <bitfield caption="Master or Slave Transmit Holding Data" mask="0x000000FF" name="TXDATA"/>
        </register>
        <register caption="SMBus Timing Register" name="TWIHS_SMBTR" offset="0x38" rw="RW" size="4">
          <bitfield caption="SMBus Clock Prescaler" mask="0x0000000F" name="PRESC"/>
          <bitfield caption="Slave Clock Stretch Maximum Cycles" mask="0x0000FF00" name="TLOWS"/>
          <bitfield caption="Master Clock Stretch Maximum Cycles" mask="0x00FF0000" name="TLOWM"/>
          <bitfield caption="Clock High Maximum Cycles" mask="0xFF000000" name="THMAX"/>
        </register>
        <register caption="Filter Register" name="TWIHS_FILTR" offset="0x44" rw="RW" size="4">
          <bitfield caption="RX Digital Filter" mask="0x00000001" name="FILT"/>
          <bitfield caption="PAD Filter Enable" mask="0x00000002" name="PADFEN"/>
          <bitfield caption="PAD Filter Config" mask="0x00000004" name="PADFCFG"/>
          <bitfield caption="Digital Filter Threshold" mask="0x00000700" name="THRES"/>
        </register>
        <register caption="SleepWalking Matching Register" name="TWIHS_SWMR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="Write Protection Mode Register" name="TWIHS_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TWIHS_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TWIHS_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="TWIHS_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
