Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71J21.xml
        <register caption="Device Endpoint Mask Register (n = 0) 5" name="USBHS_DEVEPTIMR5" offset="0x1D4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 6" name="USBHS_DEVEPTIMR6" offset="0x1D8" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 7" name="USBHS_DEVEPTIMR7" offset="0x1DC" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 8" name="USBHS_DEVEPTIMR8" offset="0x1E0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 9" name="USBHS_DEVEPTIMR9" offset="0x1E4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
